void InitRandomShipsNames()
{
	// Spain names
	int n = 0;
	n = AddStr2Array(&sRndShpSpName, n, "Сантисима Тринидад,Сан Педро Апостоль,Сантиссима Мадре,Сантьяго,Сальвадор дель Мундо,Сан Мартин,Ля Консепсьон,Сан Фелипе");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Сальвадор,Нуэстра Сеньора,Ля Салютасьон,Санта Ана,Сан Рафаэль,Ля Нативидад,Сан Матео,Соверано,Сан Николас,Сан Педро");
	n = AddStr2Array(&sRndShpSpName, n, "Хэсус Мария и Хосе,Сан Томас де Акино,Сан Хуан Баутиста,Сан Хосе,Эспириту Санто,Сан Франсиско");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Фелипе Апостоль,Сан Висенте Феррер,Мадре де Диос,Ля Виситасьон,Принсипе де Астуриас,Санта Мария,Сан Габриель,Сан Мигель,Санта Роса");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Агустин,Эсмеральда,Сан Лоренсо,Санта Исавель,Анунсиасьон,Подеросо,Феникс,Санто Кристо");
	n = AddStr2Array(&sRndShpSpName, n, "Фуэрте,Тринидад,Ля Каридад,Санта Каталина,Санта Магдалена,Гуадалупе,Анхэль де ля Гуарда,Санта Тереса,Санта Крус");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Маркос,Македа,Сан Лукас,Сан Антонио,Санто Доминго,Сан Севастьян,Викториосо,Гэррэро");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Исидро,Сан Хэнаро,Санта Маргарита,Санта Флорентина,Сан Хоакин,Триунфанте,Маравийяс,Интрэпидо");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Эухэнио,Сан Игнасио,Сан Фульхенсио,Санта Савина,Тодос Сантос,Сан Фернандо,Сан Карлос,Санто Крусифихо");
	n = AddStr2Array(&sRndShpSpName, n, "Сантьяго де Галисия,Сан Фермин,Какафуэго,Сан Грэгорио,Сан Хусто,Рэсолюсьон");
	n = AddStr2Array(&sRndShpSpName, n, "Галисия,Сан Хулиан,Сан Ильдефонсо,Сан Рамон,Сан Фиоренсо,Акилес,Санта Хэртрудис,Магдалена,Сан Бернардо");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Паскуаль,Сан Хэронимо,Санта Леокадия,Санта Матильда,Сан Кристоваль,Принсипе,Санта Сесилия,Сан Бартоломе,Принсеса");
	n = AddStr2Array(&sRndShpSpName, n, "Санта Доротэа,Санта Перпетуа,Сан Дамасо,Санта Касильда,Росарио,Атрэвида,Сантьяго эль Майор,Астрея");
	n = AddStr2Array(&sRndShpSpName, n, "Кантавро,Дилихенте,Санта Барвара,Сан Хуан Нэпомусено,Дукеса,Сан Хуан эль Менор,Сан Медель");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Батиста,Дилихэнсия,Андалусия,Ассенсьон,Сан Луис,Константе,Эрмионе,Сан Косме,Арроганте");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Андрес,Формидабле,Бенганса,Амфитрите,Санта Рита,Атрэвидо");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Диего,Сан Бруно,Санта Агеда,Санта Элена,Санта Ракель,Сан Тэльмо,Санта Брихида");
	n = AddStr2Array(&sRndShpSpName, n, "Сан Леандро,Эль Касадор,Санта Клара,Дичосо,Сан Павло Апостоль,Беляско,Сан Буэнавентура");
	n = AddStr2Array(&sRndShpSpName, n, "Асунсьон,Алькантара,Альмиранте,Сан Доминго,Санта Люсия,Инфанта,Сан Симон");
	n = AddStr2Array(&sRndShpSpName, n, "Глёриосо,Аточа,Соледад,Кастийя,Альмудена,Сан Висенте");
	n = AddStr2Array(&sRndShpSpName, n, "Фирме,Сан Бернаве,Санта Руфина,Бальенте,Сан Павло,Сэрио,Тэрривле,Нептуно,Фама");
	n = AddStr2Array(&sRndShpSpName, n, "Конкистадор,Санта Росалия,Рэй Фернандо,Фелис,Рэйна Исавель,Сегура,Сан Хуан,Эркулес,Бенсэхо,Сирена,Атланте,Бальёса");
    //22
    
	// England names
	n = 0;
	n = AddStr2Array(&sRndShpEnName, n, "Голден Финикс,Принс,Соверин,Резолюшн,Джеймс,Сэйнт Эндрю,Трайэмф,Вэнгард,Чарлз,Виктори,Спикер,Фэафакс,Юникорн");
	n = AddStr2Array(&sRndShpEnName, n, "Финикс,Лайон,Кэнтиш,Леопард,Трэдаг,Плимут,Ричард энд Марта,Эссекс,Хенри,Торрингтон,Уэймут,Ярмут,Лайм,Глостер,Марстон Муэ");
	n = AddStr2Array(&sRndShpEnName, n, "Лэнгпорт,Бриджуотер,Нэйзби,Лондон,Форчен,Сэйнт Джордж,Парагон,Лорел,Рэйнбоу,Голден Лайон,Гарлэнд,Энтренс,Бэар,Бонавэнче");
	n = AddStr2Array(&sRndShpEnName, n, "Данбар,Свифтшуэ,Мармадьюк,Вустер,Мэри Роуз,Бервик,Эшуренс,Дайменд,Ризёрв,Эссистенс,Эдвэнче,Уэлкам,Сэмпсон,Оук");
	n = AddStr2Array(&sRndShpEnName, n, "Тайгер,Ньюкасл,Вайэлет,София,Рэйвен,Саксэсс,Голден Флис,Пол,Дрэгон,Уорик,Руби,Элизабет,Хэппи Энтренс,Эдвайс");
	n = AddStr2Array(&sRndShpEnName, n, "Сэффайе,Центурион,Пеликан,Форсайт,Лисса Мерчант,Реформэйшн,Тонтен,Портсмут,Бристол,Портлэнд,Прэстон,Дувэ,Хэмпшир,Гейнсборо");
	n = AddStr2Array(&sRndShpEnName, n, "Нантвич,Мэйдстен,Джерси,Уинзби,Нонсач,Ривендж,Грэйт Президент,Мэйднхэд,Вулидж,Эмити,Краун,Сара,Спай,Суоллоу,Мэри,Хартсиз,Геркулес");
	n = AddStr2Array(&sRndShpEnName, n, "Президент,Уэйкфилд,Дискавери,Лойалти,Хенриетта Мариа,Экспедишн,Черитон,Гини,Конверт,Лисбен Мерчант,Энтони Бонавэнче,Иксчейндж,Томас энд Уильям,Миддлберг,Ганнибал,Грэнтем,Тюлип");
	n = AddStr2Array(&sRndShpEnName, n, "Провиденс,Бэнджамин,Гифт,Уотерхаунд,Питер,Олд Уорик,Малага Мерчант,Дрэгонэа,Рубен,Найтингейл,Рекавери,Стар,Грейхаунд,Гиллифлауэр,Рэд Харт,Рут");
	n = AddStr2Array(&sRndShpEnName, n, "Мермэйд,Уильям,Юнити,Эдвантидж,Хантер,Инкрис оф Лондон,Уэксфорд,Хоупвелл,Крэсчент,Индастри,Дачесс,Суон,Долфин,Мэриголд");
	n = AddStr2Array(&sRndShpEnName, n, "Каллен,Хектор,Фалмут,Глоуб,Джонатан,Примроуз,Голден Доув,Кэтрин,Перл,Кент,Самаритен,Перегрин,Уильям энд Джон,Марта,Калпеппер");
	n = AddStr2Array(&sRndShpEnName, n, "Пикок,Чатем,Роубак,Черити,Просперус,Принсесс Мэри,Эйкорн,Прудент Мэри,Леди,Никодемус,Брайер,Индиан,Оксфорд,Гриффин,Самъюэл,Фэйм,Ринаун");
	n = AddStr2Array(&sRndShpEnName, n, "Джон энд Кэтрин,Фолкен,Харп,Блэкмор,Магдален оф Лондон,Блоссем,Лили,Мартин,Форестер,Роузбуш,Сэвен Бразерз,Олд Саксэсс,Парадокс,Харт");
	n = AddStr2Array(&sRndShpEnName, n, "Роуз,Хок,Брамбл,Сигнет,Честнат,Фокс,Конкорд оф Ярмут,Роузмэри,Элерт,Трайэл,Ньюбери,Энглси,Сорлингз");
	n = AddStr2Array(&sRndShpEnName, n, "Дрэйк,Спиди,Флай,Хэджхог,Трулав,Хаунд,Хамберг Мерчант,Иглет,Фрэнсис,Лизард,Хайнд,Уэстергейт,Мерлин");
	n = AddStr2Array(&sRndShpEnName, n, "Нимбл,Энн,Эксетер,Хенриетта,Харидж,Дредноут,Уильям энд Томас,Игл,Марлин,Конвертин,Бигл,Уолверин,Литтл Президент,Фо Систерз");
	n = AddStr2Array(&sRndShpEnName, n, "Снэйк,Индэвор,Меркьюри,Девоншир,Милфорд,Нимбл Сэффайе,Спидвелл,Гернси,Элайес,Глориес,Огастин,Сассекс,Саффолк,Корнуолл,Пемброук");
	n = AddStr2Array(&sRndShpEnName, n, "Норидж,Пегасес,Берфорд,Принсесс,Дартмут,Литтл Гифт,Хоуп,Кембридж,Грэйт Гифт,Протектор,Колчестер,Ковентри,Литтл Черити");
	n = AddStr2Array(&sRndShpEnName, n, "Дептфорд,Энн энд Джойс,Эйнджел,Чейс,Уорспайт,Томас Бонавэнче,Ричард,Сторк,Селби,Вайпер,Хамбер,Энн Пирси,Рэд Лайон,Кардифф,Кимберли");
	n = AddStr2Array(&sRndShpEnName, n, "Элефант,Резистенс,Сэсайети,Эндрю,Сихорс,Кинг Фердинанд,Дифайенс,Льюис,Сьюзен,Кроу,Брэдфорд,Ньюарк,Честер,Либерти,Джайлз,Медуэй,Гифт Пинк,Эдгар");
	n = AddStr2Array(&sRndShpEnName, n, "Бэйсинг,Мэйфлауэр,Голден Кок,Сатисфэкшн,Литтл Мэри,Норфолк,Мэри Прайз,Рипалс,Интрэпид,Олд Джеймс,Джордж,Тэррибл,Одэйшес,Хаф Мун,Констант Уорик,Грэйт Черити,Эстридж,Армз оф Холлэнд");
    //21
    
	// France names
	n = 0;
	n = AddStr2Array(&sRndShpFrName, n, "Вандом,Жюпите,Сезар,Кярдиналь,Мазарен,Триомфан,Сен Люи,Бурбон,Конкеран,Энвансибль,Виктуар,Куронн,Люин,Эмино,Колосс,Режин");
	n = AddStr2Array(&sRndShpFrName, n, "Монаркь,Парфе,Тулон,Антрепид,Анфлексибль,Ройяль Дюкь,Террибль,Бретань,Глорью,Эркюль,Редутабль,Авантюрье,Манификь,Тигр");
	n = AddStr2Array(&sRndShpFrName, n, "Формидабль,Вьерж,Драгон,Азардю,Кепабль,Фоко,Арк ан Сьель,Бизарр,Данкеркуа,Миньон,Нептюн,Опиньятр");
	n = AddStr2Array(&sRndShpFrName, n, "Реномме,Сирэн,Бруталь,Авено,Фронсуаз,Вилль де Руан,Эоль,Трийомф,Куражю,Ройяль,Солид,Фидэль,Сурди");
	n = AddStr2Array(&sRndShpFrName, n, "Пранс,Брийон,Энфонт,Байоннэ,Волюнтэр,Эльбёф,Лё Авр,Эрмьон,Пальмье,Антандю,Тромпюз,Вижило,Тритон");
	n = AddStr2Array(&sRndShpFrName, n, "Провансаль,Турбийон,Эрмин,Эмерийон,Эвейе,Солей Африкь,Арди,Льён,Ферм,Кеше,Сёрью,Адруа,Совер,Экюрай,Леже");
	n = AddStr2Array(&sRndShpFrName, n, "Аррого,Фавори,Актиф,Пэрль,Флямо,Марки,Лёрье,Сен Себастьян,Эгль,Ораж,Кеприсью,Петийо");
	n = AddStr2Array(&sRndShpFrName, n, "Ампортэ,Африкен,Шонже,Ассюрэ,Гейярд,Гран Понтон,Амбускяд,Ироин,Мадлен,Перью");
	n = AddStr2Array(&sRndShpFrName, n, "Буффонн,Эклер,Найяд,Альсьён,Мютин,Волянт,Сен Жозеф,Тампэт,Ирондэль,Орор,Байон,Кристин,Донжрю,Валёр");
	n = AddStr2Array(&sRndShpFrName, n, "Седитью,Випэр,Сибий,Жуаюз,Эмерод,Постийон,Сан Пер,Энкоммод,Нереид,Этуаль,Салямандр,Бэлль,Серпан");
	n = AddStr2Array(&sRndShpFrName, n, "Коммод,Гелятэ,Дьеппуаз,Эбондант,Брюн,Шёкант,Флёр де Лис,Сюрпренонт,Рошёлез,Гелляр,Жантий,Медюз,Энконню");
	n = AddStr2Array(&sRndShpFrName, n, "Лютин,Жёли,Мешонт,Дюкь,Тюрбюлянт,Кюрьюз,Агят,Пётит Энфант,Дилижонт,Грасьюз,Дискрэт,Антрепрено,Сорсьер,Серпант");
	n = AddStr2Array(&sRndShpFrName, n, "Бофор,Энсансе,Сюффизант,Эйфронтэ,Конт,Сюпэрб,Сен Мишель,Фюрьюз,Рен,Эсперонс,Топаз,Мукёз,Воляж,Рюзе,Фляттюз,Куртизант");
	n = AddStr2Array(&sRndShpFrName, n,  "Тромпетт,Райюз,Буссоль,Реванш,Брускь,Фудройян,Лёврэтт,Бравур,Мор,Жялюз");
	//14
	
	// Pirate names
	n = 0;
	n = AddStr2Array(&sRndShpPiName, n, "Косуля,Призрак,Возмездие,Дельфин,Дракон,Морской Дьявол,Маргарет,Судьба,Альбатрос,Жемчужина,Кобра,Джейкоб,Паук,Кокетка Сью,Смерч,Виктори,Ужас Мэйна,Причуда");
	n = AddStr2Array(&sRndShpPiName, n, "Змея,Демон,Ураган,Свобода,Пегас,Хищник,Кoлecо Фoртуны,Росомаха,Стрелок,Пророк,Молния,Воин,Пилигрим,Акула,Скромница,Вдоводел,Далила,Счастливчик Хью");
	n = AddStr2Array(&sRndShpPiName, n, "Нептун,Принцесса,Приговор,Авадон,Мурена,Кровавый Пир,Шалунья,Пеликан,Лахезис,Морской Еж,Пандора,Атропос,Злая Шутка,Серый Ангел");
	n = AddStr2Array(&sRndShpPiName, n, "Чёрный Принц,Китти,Летящий Дракон,Плутон,Шаровая Молния,Ястреб,Трезубец,Пороховой Погреб,Колокол Мести,Мститель,Сияние,Удача,Зовущий Бурю,Око бездны,Гермес");
	n = AddStr2Array(&sRndShpPiName, n, "Восходящее Солнце,Весёлый мертвец,Доблестный,Ангел Ночи,Согласие,Падший Ангел,Яростный,Кровавый Билл,Провидение,Дикий Вепрь,Неодолимый,Верная Смерть,Чарльз,Счастливая Доставка,Приключение");
	n = AddStr2Array(&sRndShpPiName, n, "Чёрная Смерть,Любимец Удачи,Лакомство,Летучая Рыба,Фурия,Русалка,Смелый,Воля Судьбы,Ведьма,Большая Удача,Глаз Бури,Задира,Покаяние,Золотая Удача,Проворный,Скиталец,Антилопа,Счастливый Случай");
	n = AddStr2Array(&sRndShpPiName, n, "Рысак,Гончий Пёс,Тигр,Чёрный Бык,Скакун,Морской Ястреб,Сокол,Чёрный Алмаз,Ласточка,Авантюрист,Бродяга,Ночной Кошмар,Алмаз,Охотник,Морской Конёк,Аквилон,Морская Ведьма,Озорник");
	n = AddStr2Array(&sRndShpPiName, n, "Красивая Курица,Сюрприз,Роковая Красавица,Чёрная Каракатица,Бешеный Билл,Странник,Чёрная Гадюка,Чёрный Дракон,Форейтор,Юпитер,Медуза,Разъярённый Лев,Чёрный Лебедь,Чёрная Ведьма,Феникс,Ищейка,Вездесущий,Морская Змея");
	n = AddStr2Array(&sRndShpPiName, n, "Фантом,Буревестник,Преподобный,Уильям,Ядовитый Змей,Душегуб,Габриэль,Весельчак Хэм,Чёрная Молния,Грифон,Обманщик,Троица,Разящая Стрела,Услада Холостяка,Лебедь,Женоненавистник,Старый Роджер,Чёрный Ворон,Большой Скиталец");
    //9
    
	// Holland names
	n = 0;
	n = AddStr2Array(&sRndShpHoName, n, "Акербоом,Дефентер,Фрисланд,Зон,Оостерхо,Принсес Люиса,Бесхермер,Оранье,Вапен фан Нассау,Худа,Зейфен Провинсиен,Рейхерсберхен,Вапен фан Энкхайзен,Хроот Фрисия,Утрехт,Херехтиххэд,Фреде");
	n = AddStr2Array(&sRndShpHoName, n, "Марс,Голландия,Фрейгэд,Бредероде,Флиссинхен,Зварте Леу,Хронинген,Витте Лам,Йаарсфелд,Эйндрахт,Хелдерланд,Зварте Был,Меркуриес,Камэел,Фереенихде Провинсиен,Зютфен,Храаф Виллем,Фохелстраюс");
	n = AddStr2Array(&sRndShpHoName, n, "Кампен,Дри Конинген,Нептюнус,Синт Мариа,Зварте Биэр,Нассау,Аартсэнгел Михиэл,Саардам,Принс те Паард,Хекроонде Лифде,Синт Матеус,Принс Мауритс,Миерман,Хрооте Лифде,Роттердам,Гаарлем,Моор,Синт Салфадор,Маан,Монникендам");
	n = AddStr2Array(&sRndShpHoName, n, "Хидеон фан Саардам,Синт Паулюс,Леуварден,Принсес Ройаал,Амстердам,Кроон Империал,Гооп,Принс Виллем,Схэепсверф,Хауден Долфен,Боммел,Маахт фан Энкхайзен,Алкмаар,Ахиллес,Зейфен Вауден,Архе Тройяне,Стер,Леувин,Вакенде Краан");
	n = AddStr2Array(&sRndShpHoName, n, "Званенбюрх,Оферэйссел,Голландше Тайн,Вапен фан Алкмаар,Схаапгердер,Рооде Леу,Фаам,Валхерен,Гааст Фелд,Хрун Драак,Зеериддер,Эйнгоорн,Энгел Хабриэл,Блауве Рейхер,Хауден Зеепард,Морхенстер");
	n = AddStr2Array(&sRndShpHoName, n, "Виндгонд,Энгел Михиэл,Сампсон,Пирбоом,Вапен фан Звитен,Лопенде Герт,Зеегаэн,Албертина,Хрооте Синт Люкас,Синт Франсиско,Вапен фан Голланд,Витте Олифант,Зеегонд,Флихенде Драак,Храаф Гендрик,Монник,Яхтхонд");
	n = AddStr2Array(&sRndShpHoName, n, "Хауден Леу,Вапен фан Зееланд,Синт Питер,Блауве Аренд,Зееландиа,Хриффиюн,Хюниэерде Провинсиен,Амилиа,Александер,Хаюс фан Нассау,Принс фан Оранье,Ораньебоом,Мариа,Йонге Принс,Миермин,Розбоом,Бюрх фан Алкмаар,Кюрфорст фан Кюлен");
	n = AddStr2Array(&sRndShpHoName, n, "Ферхулде Феникс,Лейден,Йахер,Зеепард,Тэтис,Зварте Аренд,Тритон,Хэемскерк,Афонтюриер,Флюххэд,Хлуйенде Офен,Зон фан Энкхайзен,Батафиа,Стад фан Медемблик,Схоонгэд,Кемпгаан,Синт Финсент,Флихенде Фаам,Зеемиермин");
	n = AddStr2Array(&sRndShpHoName, n, "Юлиес Сейсар,Охтендстер,Фаам фан Мидделбюрх,Вест Капэлле,Кастэел фан Медемблик,Вестерхо,Гектор фан Тройе,Антониюс Бонафентюре,Халфе Маан,Ферхулде Гаан,Снелгэд,Лифде,Хауден Раютер,Витте Рейхер,Дордрехт");
	n = AddStr2Array(&sRndShpHoName, n, "Элиас,Хауден Заал,Сара,Вапен фан Гоорн,Розенкранс фан Голланд,Синт Ян,Витте Эйнгоорн,Зварте Рейхер,Дафид эн Холиат,Энкхайзен,Синт Лауренс,Рооде Гаэс,Зеемеу,Хауден Стер,Заюдерфелд,Маахт фан Дордрехт,Флихенде Герт,Зварте Лам,Ферхулде Фортайн,Фазант");
	//10
}
